[
  {
    "id": 0,
    "title": "Gradus",
    "skills": "Heroku deployment, React.js, Express.js, Node.js, Mongoose/MongoDB, Bcrypt, Passport.js, JSON Web Token, Web Midi API, Bootstrap",
    "summary": "A counterpoint learning system for advanced music theory students",
    "role": "Developed user-input virtual piano with full octave range, pair-coded multiple front-end components such as “ExCard”, routed Cantus Firmus database to front-end to display under “pick” on ExCards",
    "githubLink": "https://github.com/sarahtam718/Gradus"
  },
  {
    "id": 1,
    "title": "Todo Toast",
    "skills": "Heroku deployment, React.js, Express.js, Node.js, MongoDB, Mongoose, Axios, Bootstrap",
    "summary": "Convenient, simple task manager to help you prioritize and accomplish your tasks so that you can spend more time on those things that don't belong on a todo list! Enjoy features such as adding, editing, and marking complete each task. See all tasks in one place. More to follow!",
    "role": "Independent",
    "githubLink": "https://github.com/sarahtam718/todo-toast"
  },
  {
    "id": 2,
    "title": "Spatify",
    "skills": "Heroku deployment, MySQL, Sequelize, Node.js, Handlebars,Later.js, Moment.js, Node Mailer, Materialize",
    "summary": "A beauty appointment scheduler",
    "role": "Developed and consolidated routes for Handlebars front to back, assisted in creating services page, created home page and form with dynamic buttons for appointment times",
    "githubLink": "https://github.com/sarahtam718/spatify"
  },
  {
    "id": 3,
    "title": "LIRI Bot",
    "skills": "Node.js, Axios, Chalk-Animation, Figlet, Inquirer, Moment.js, Node Spotify API",
    "summary": "LIRI is a command line node app that takes in parameters and gives you back data. A user can look up concerts for favorite artists to see when they'll be in town, or call details for songs to know more about them and get a preview, or look up movies to see if they might be an interesting watch!",
    "role": "Independent",
    "githubLink": "https://github.com/sarahtam718/liri-node-app"
  },
  {
    "id": 4,
    "title": "GifTastic",
    "skills": "JQuery, AJAX, Giphy API",
    "summary": "A fun search engine for gifs from the Giphy API. User types in an animal and then presses that dynamically created button to view 10 gifs of that creature.",
    "role": "Independent",
    "githubLink": "https://github.com/sarahtam718/GifTastic"
  }
]
